app/Controllers/Laporan.php

    public function edit($nik)
{
    // Use correct variable name $supplier (lowercase) instead of $Supplier (uppercase)
    $laporan = $this->LaporanModel->find($nik);
---
SELECT *
FROM `laporan`
WHERE `laporan`.`nik` = '14060107'